app/controllers/ticket_types_controller.rb

  def index
    @ticket_types = TicketType.all
---
SELECT "ticket_types".* FROM "ticket_types"

  def show
    @ticket_type = TicketType.find_by_id(params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]