app/controllers/tickets_controller.rb

SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params[:ticket_type_id]
      @tickets = TicketType.find(params[:ticket_type_id]).includes(:ticket_types).tickets